#include <stdio.h>
/* Написать программу которая печает значения символов по таблице АСЦ2*/

int main(void) {
    printf("%d %d %d %d\n", 'A', 'B', 'C', 'a');
    printf("%d %d %d %d\n", 'b', 'c', '0', '1');
    printf("%d %d %d %d\n", '2', '$', '*', '+');
    printf("%d %d", '/', ' ');
    return 0;
}
